Revit 2027 API
FabricArea.GetValidViewsForTags Method
 Gets ids of the views where tags and symbols can be placed for the FabricArea and/or FabricSheets
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetValidViewsForTags()
Public Function GetValidViewsForTags As IList(Of ElementId)
public:
IList<ElementId^>^ GetValidViewsForTags()
member GetValidViewsForTags : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The collection of View ElementIds.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace